package L07_Nested_Loops;//3. Комбинации
//Напишете програма, която изчислява колко решения в естествените числа (включително и нулата) има
//уравнението x1 + x2 + x3 =n
//Числото n е цяло число и се въвежда от конзолата.
//Примерен вход и изход
//Вход Изход
//25    351
//Обяснения
//Генерираме всички комбинации от 3 числа,
//като първата е
//0+0+0=0, но понеже не е равна на 25,
//продължаваме:
//0+0+1=1 - също не е 25 и т.н.
//Стигаме до първата валидна комбинация:
//0 + 0 + 25 = 25, увеличаваме броя на валидни комбинации с 1, втората валидна комбинация
//е:
//0+ 1+ 24 25
//Tpeтата:
//0 + 2 + 23 = 25 и т.н.
//След генериране на всички възможни комбинации, броят на валидните е 351.
import java.util.Scanner;

public class p3_VLOJEN_Комбинации {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int number = Integer.parseInt(scanner.nextLine());
        int count = 0;
        // x1+x2+x3 = number
        for (int x1 = 0; x1 <= number ; x1++) {
            for (int x2 = 0; x2 <= number ; x2++) {
                for (int x3 = 0; x3 <= number ; x3++) {
                    int sum = x1+x2+x3;
                 if (sum == number) {
                     ;count++;
                 }
        }
    }
} System.out.println(count);
    }
}